import 'package:flutter/material.dart';
import 'package:flutter_bloc/flutter_bloc.dart';
import 'package:speakean/constant.dart';
import 'package:speakean/model/user.dart';
import 'package:speakean/path.dart';
import 'package:speakean/view/component/button.dart';

import 'component/dialog.dart';
import 'component/scaffold.dart';

class Setting extends StatelessWidget {

  final double contentHeight = 320;

  const Setting({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return MyScaffold(
      appBar: MyAppBar(
        leading: Builder(
          builder: (context) {
            return GestureDetector(
              onTap: () {
                PathManager.instance.pop(context);
              },
              child: const Icon(
                Icons.arrow_back_ios,
              ),
            );
          },
        ),
        title: const Text(
          "SETTING",
          style: myAppBarTitleTextStyle,
        ),
      ),
      body: Padding(
        padding: myBodyPadding,
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.stretch,
          children: [
            SettingButton(
              title: "개인정보 보호 방침",
              onPressed: () async {
                showDialog(
                  context: context,
                  builder: (context1) {
                    const content = "스피키안 개인정보 처리방침스피키안은 개인정보보호법에 따라 다음과 같은 처리 방침을 두고 있습니다. 개인정보 처리방침 개정 시, 웹사이트를 통한 공지 또는 이메일을 통해 개별적으로 공지할 것입니다.제 1조 (개인정보 수집 항목)스피키안은 다음의 각 호의 항목에 따라 개인정보를 수집합니다. 각 호에서 수집한 개인정보 이외에 서비스 이용에 필요한 개인정보의 항목을 추가 요청할 시, 회원 개인에게 개별적으로 공지할 것입니다.가. 최초 회원가입 시 개인정보 수집스피키안은 회원가입 및 관리를 위해 회원가입 시, 회원으로부터 다음의 개인정보를 수집하고 있습니다.  - 수집정보 : 가입 시 사용한 SNS 계정 아이디, 비밀번호, 휴대 전화번호나. 서비스 이용 시 개인정보 수집스피키안은 원활한 서비스 제공을 위해 회원으로부터 추가적인 개인정보를 수집하고 있습니다. 각 호에 해당하는 추가 개인정보는 다음과 같습니다.(1) 회원 수집정보 : 이메일, 타 SNS 계정 아이디, 사진, 자기소개 등의 정보제 2조 (개인정보 수집 방법)스피키안은 다음 각 호의 방법으로 개인정보를 수집합니다.(1)스피키안이 제공하는 웹사이트를 통한 수집 (2)회원의 자발적 개인정보 제공을 통한 수집(2)생성 정보 수집 툴을 통한 수집제 3조 (개인정보 처리 목적)스피키안은 개인정보를 다음의 목적을 위해 수집합니다. 수집한 개인정보는 다음의 목적 이외의 용도로는 사용되지 않으며, 수집 목적이 변경될 시에는 사전 동의를 구할 것입니다.가. 웹사이트 회원가입 및 관리 스피키안은 웹사이트에 가입하는 회원의 가입의사 확인, 회원 본인 식별 인증, 회원자격 유지·관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스 부정이용 방지, 만14세 미만 아동 개인정보 수집 시 법정대리인 등의 여부 확인, 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등을 목적으로 개인정보를 처리합니다.나. 서비스 제공스피키안은 서비스 및 콘텐츠 제공, 본인인증, 연령인증 등을 목적으로 개인정보를 처리합니다.다. 민원사무 처리스피키안은 서비스와 관련한 민원에 대해 민원사항 확인, 신원확인, 사실조사를 위한 연락·통지, 처리결과 통보 등의 목적으로 개인정보를 처리합니다.라. 마케팅 및 광고 활용스피키안은 신규 서비스 알림, 이벤트 및 광고성 정보 제공, 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.제 4조 (개인정보의 처리 및 보유 기간)스피키안은 법령에 따른 개인정보 보유·이용기간 또는 회원으로부터 개인정보를 수집 시, 이용기간 내에서 동의 받은 개인정보를 처리, 보유합니다. 각 호의 개인정보 처리 및 보유 기간은 다음과 같습니다.가. 웹사이트 회원가입 및 관리<웹사이트 회원가입 및 관리>와 관련한 개인정보는 수집, 이용에 관한 동의일로부터 준영구적으로 위 이용목적을 위하여 보유, 이용됩니다.- 보유근거 : 정보통신망 이용촉진 및 정보보호- 관련법령 : 1) 신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년2) 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년3) 대금결제 및 재화 등의 공급에 관한 기록 : 5년4) 계약 또는 청약철회 등에 관한 기록 : 5년5) 표시/광고에 관한 기록 : 6개월나. 서비스 제공<재화 또는 서비스 제공>과 관련한 개인정보는 수집. 이용에 관한 동의일로부터 준영구적으로 위 이용목적을 위하여 보유. 이용됩니다.- 보유근거 : 정보통신망 이용촉진 및 정보보호- 관련법령 : 1) 신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년2) 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년3) 대금결제 및 재화 등의 공급에 관한 기록 : 5년4) 계약 또는 청약철회 등에 관한 기록 : 5년5) 표시/광고에 관한 기록 : 6개월다. 민원사무 처리<민원사무 처리>와 관련한 개인정보는 수집. 이용에 관한 동의일로부터 준영구적으로 위 이용목적을 위하여 보유. 이용됩니다.- 보유근거 : 정보통신망 이용촉진 및 정보보호- 관련법령 : 1) 신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년2) 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년3) 대금결제 및 재화 등의 공급에 관한 기록 : 5년4) 계약 또는 청약철회 등에 관한 기록 : 5년5) 표시/광고에 관한 기록 : 6개월라. 마케팅 및 광고 활용<마케팅 및 광고에의 활용>와 관련한 개인정보는 수집. 이용에 관한 동의일로부터 준영구적으로 위 이용목적을 위하여 보유. 이용됩니다.- 보유근거 : 정보통신망 이용촉진 및 정보보호- 관련법령 : 1) 신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년2) 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년3) 대금결제 및 재화 등의 공급에 관한 기록 : 5년4) 계약 또는 청약철회 등에 관한 기록 : 5년5) 표시/광고에 관한 기록 : 6개월제 5조 (개인정보 제3자 제공 원칙)스피키안은 회원의 사전 동의 없이 회원의 개인정보를 제3자에 제공하거나 외부에 공개하지 않습니다. 다만, 다음 각 호의 경우는 예외로 합니다.(1)사전에 회원이 정보 공개에 동의한 경우(2)법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우(3)스피키안이 제공하는 서비스를 통해 계약 성사 시, 계약과 관련한 정보를 쌍방 당사자가 요구하는 경우제 6조 (개인정보 처리 위탁) 스피키안은 위탁계약 체결시 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적․관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리․감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다. 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체 없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.제 7조 (회원의 권리 행사) 회원은 스피키안에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.1. 개인정보 열람요구2. 오류 등이 있을 경우 정정 요구3. 삭제요구4. 처리정지 요구 제1항에 따른 권리 행사는 스피키안에 대해 개인정보 보호법 시행규칙 별지 제8호 서식에 따라 서면, 전자우편, FAX등을 통하여 하실 수 있습니다. 스피키안은 본인 확인을 위한 요청인의 신분증 사본 등의 증표를 제시 받아 해당 요구가 진정한 본인의 의사인지 여부를 확인할 수 있으며, 본인으로 확인되고 개인정보에 오류가 있거나 보존기간을 경과한 것이 판명되는 등 정정 또는 삭제할 필요가 있다고 인정되는 경우 지체 없이 그에 따른 조치를 취합니다.  회원이 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우, 스피키안은 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다. 제1항에 따른 권리 행사는 회원의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하여야 합니다.제 8조 (개인정보의 파기)스피키안은 개인정보 처리목적이 달성된 경우에는 지체 없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.-파기절차회원이 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.-파기기한 회원의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.-파기방법전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.제 9조 (법정대리인의 권리)법정대리인은 만 14세 미만 아동의 개인정보 수집·이용 또는 제공에 대한 동의를 철회할 수 있으며, 해당 아동이 제공한 개인정보에 대한 열람 또는 오류의 정정을 요구할 수 있습니다.유선 또는 서면을 통하여 만 14세 미만 아동인 회원의 법정대리인이 열람, 증명을 요구하는 경우, 스피키안은 대리관계를 증명하는 위임장 및 인감증명서, 요청인 및 대리인의 신분증 사본 등의 증표를 제시 받아 해당 요구를 하는 자가 법정대리인인지 여부를 확인합니다.제 10조 (스피키안의 개인정보 열람 및 이용 제한)회원 또는 법정대리인의 요청에 의해 해지 또는 삭제, 정정된 개인정보는";

                    return MyDialog(
                      height: contentHeight,
                      child: const SingleChildScrollView(
                        child: Text(
                          content,
                        ),
                      ),
                    );
                  },
                );
              },
            ),
            const SizedBox(
              height: 24,
            ),
            SettingButton(
              title: "약관 및 정책",
              onPressed: () async {
                showDialog(
                  context: context,
                  builder: (context1) {
                    const content = "스피키안 이용약관제1조 (목적)본 약관은 주식회사 스피키안(이하 \"스피키안\"이라 합니다.)이 회원에게 제공하는 외주 기획서 제작 서비스(이하 “서비스”라 합니다.)의 이용과 관련하여 스피키안과 회원 간의 권리, 의무, 책임사항 및 기타 필요한 사항을 규정함을 목적으로 합니다.제2조 (용어의 정의)본 약관에서 사용하는 용어의 정의는 다음과 같습니다.(1) \"회원\"이란 본 약관에 동의하고 스피키안 서비스를 포함한 스피키안이 관리/운영하는 웹사이트 및 어플리케이션 등 서비스 플랫폼 일체를 의미함)의 회원가입 절차를 완료한 자를 의미합니다.(2) “고객”이란 스피키안에 가입한 회원으로 스피키안의 서비스를 이용하는 회원을 말합니다.(3) “계정(ID)”이란 회원의 식별과 서비스 이용을 위하여 회원이 선정하고 스피키안이 부여하는 문자, 숫자 또는 특수 문자의 조합을 말합니다.(4) “비밀번호”란 회원 인증에 따른 불편함을 없애기 위해 이용자의 일치여부를 판별하는데 사용되는 것으로, 회원이 선정한 문자, 숫자, 특수 문자의 조합을 말합니다.제3조 (약관의 명시와 설명 및 개정)스피키안은 이 약관의 내용을 회원이 알 수 있도록 스피키안 서비스에 게시하거나 연결화면을 제공하는 방법으로 회원에게 공지합니다.(1) 스피키안은 회원이 이 약관의 내용과 상호 및 대표자 성명, 영업소 소재지 주소(소비자의 불만을 처리할 수 있는 곳의 주소를 포함), 전화번호․ 전자우편주소, 개인정보 관리책임자등을 이용자가 쉽게 알 수 있도록 스피키안의 웹사이트에 게시합니다. 다만, 약관의 내용은 회원이 연결화면을 통하여 볼 수 있도록 할 수 있습니다.(2) 스피키안은 「약관의 규제에 관한 법률」 등 관련 법령에 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.(3) 스피키안은 약관을 개정할 경우에는 적용일자 및 개정내용, 개정 사유 등을 명시하여 적용일자로부터 7일 이전(회원에게 불리하거나 중대한 사항의 변경은 30일 이전)부터 그 적용일자 경과 후 상당한 기간이 경과할 때까지 초기화면을 통해 공지합니다.(4) 스피키안은 약관을 개정할 경우에는 원칙적으로 개정약관 공지 후 개정약관의 적용에 대한 회원의 동의 여부를 확인합니다. 다만 개정약관 공지 시 회원이 동의 또는 거부의 의사표시를 하지 않으면 승낙한 것으로 간주하겠다는 내용도 함께 공지한 경우에는 회원이 약관 시행일까지 거부의사를 표시하지 않는다면 개정약관에 동의한 것으로 간주할 수 있습니다. 회원이 개정약관의 적용에 동의하지 않는 경우 회원은 스피키안 서비스 이용계약을 해지할 수 있습니다.제4조 (서비스 제공 및 중단)서비스의 이용은 회사의 업무상 또는 기술상 특별한 지장이 없는 한 연중 무휴 1일 24시간을 원칙으로 합니다. 회사는 시스템 점검이나 서비스 보수가 있을 경우에는 웹사이트 내에 공지하여 서비스를 일시정지 할 수 있습니다.제5조 (회원가입)(1) 회원은 스피키안이 정한 가입 양식에 따라 회원정보를 입력하고, 약관에 동의한다는 의사표시를 함으로서 회원가입을 신청합니다.(2) 스피키안은 제 1항과 같이 가입을 신청한 회원 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다. 1. 가입신청자가 이 약관 제7조제3항에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 다만 제7조제3항에 의한 회원자격 상실 후 3년이 경과한 자로서 “서비스”의 회원 재가입 승낙을 얻은 경우에는 예외로 한다. 2. 등록 내용에 허위, 기재누락, 오기가 있는 경우 3. 기타 회원으로 등록하는 것이 “서비스”의  기술상 현저히 지장이 있다고 판단되는 경우(3) 스피키안은 회원이 되려고 하는 자에게 실명확인 및 본인인증, 기타 필요한 정보를 요구할 수 있으며, 그 절차와 방식은 관련 법령에 따릅니다.(4) 회원이 되려고 하는 자는 이용 신청 시 요구하는 정보 항목에 대하여 실제 정보를 기재하여야 합니다. 실명 또는 정보를 허위로 기재하거나 타인의 명의를 도용한 경우 이 약관에 의한 회원의 권리를 주장할 수 없고, 스피키안은 환급 없이 서비스 이용계약을 취소하거나 해지할 수 있습니다.(5) 회원가입은 회원의 이용 약관에 대한 동의로 성립합니다. 이용 약관에 관한 동의는 이용 신청 당시 스피키안 이용약관에 동의함을 선택하거나 기타 동의 버튼 또는 서명 등을 통해 의사표시를 합니다.(6) 회원은 회원가입 시 등록한 사항에 변경이 있는 경우, 상당한 기간 이내에 스피키안에 대하여 회원정보 수정 등의 방법으로 그 변경사항을 알려야 합니다.제6조 (회원에 대한 통지)스피키안은 회원에 대한 통지를 하는 경우, 회원이 스피키안의 회원정보에 미리 지정한 전자우편 주소로 할 수 있습니다. 불특정다수 회원에 대한 통지의 경우 1주일 이상 웹사이트에 게시함으로서 개별 통지에 갈음할 수 있습니다. 다만, 회원 본인에게 중대한 영향을 미치는 사항에 대하여는 개별통지를 원칙으로 합니다.제7조 (개인정보의 보호 및 관리)스피키안은 관련 법령이 정하는 바에 따라 계정정보 등을 포함한 회원의 개인정보를 보호하기 위해 노력합니다. 회원의 개인정보의 보호 및 사용에 대해서는 관련 법령 및 스피키안이 별도로 고지하는 개인정보 처리방침이 적용됩니다.스피키안은 회원이 안전하게 서비스를 이용할 수 있도록 개인정보, 신용정보의 보호를 위해 보안시스템을 갖추어야 하며 개인정보 처리방침을 공시하고 준수합니다. 스피키안은 관련 법령, 본 약관 및 개인정보 처리방침에서 정한 경우를 제외하고는 회원의 개인정보가 제3자에게 공개 또는 제공되지 않도록 합니다.스피키안은 회원의 귀책사유로 인하여 노출된 회원의 계정정보를 포함한 타인의 모든 개인정보, 비밀정보에 대해서 일체의 책임을 지지 않습니다.스피키안은 서비스를 확장 ᆞ추가하는 경우 회원의 개인정보 및 데이터를 이전할 수 있고, 이전한 개인정보 및 데이터를 이용할 수 있습니다.제8조 (회원의 의무)회원은 다음 행위(또는 이에 준하는 행위를 포함함)를 하여서는 안 됩니다.(1)비정상적인 시스템 접근악성코드, 바이러스 등의 프로그램을 고의 또는 과실로 설치, 유포하는 행위프로젝트의 정보 및 개발자의 정보를 수집하기 위해 크롤링을 하는 행위(2)비정상적인 서비스 이용허위 또는 타인의 정보로 가입을 하는 행위계정 내 불리한 정보를 삭제하기 위해 의도적으로 계정을 탈퇴/재가입하는 행위상습적으로 프로젝트 진행 의사 없이 견적 및 구현 가능 여부를 판단하기 위한 목적으로 서비스를 이용하는 행위고객이 모집 중에 프로젝트의 내용을 상습적으로 변경, 조정하는 행위동일 또는 유사한 내용(비용 및 기간을 포함)의 프로젝트를 반복하여 등록하는 행위(3)기타본 조에 준하는 행위로서 스피키안의 이익(영업)을 저해하는 행위스피키안의 동의 없이 영리, 영업, 광고, 정치활동 등을 목적으로 서비스를 사용하는 행위자기 또는 타인에게 재산상의 이익을 주거나 타인에게 손해를 가할 목적으로 허위의 정보를 유통시키는 행위관련 법령에서 금지하거나 선량한 풍속 기타 사회통념상 허용되지 아니하거나 원활한 서비스 제공에 악영향을 끼치는 행위회원은 본 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항, 스피키안이 통지하는 사항 등을 확인하고 준수할 의무가 있습니다.제15조(서비스의 변경 및 내용 수정)스피키안은 운영상, 기술상의 필요에 따라 서비스 내용을 수정하거나 변경할 수 있으며, 이 경우 변경 사항을 스피키안 웹사이트에 공지합니다. 이에 대하여 스피키안은 회원 또는 제3자에 어떠한 책임도 부담하지 않습니다.제16조(서비스의 취소 및 환불) 환불, 취소 절차 약관은 업무의 진행을 의뢰한 고객과 업무를 수행하는 개발자간 체결하게 되는 계약에 대해 발생하는 모든 문제를 원만하게 해결하는 것에 가장 큰 목적을 갖습니다. 이는 고객과 개발자가 회원 간 서비스 계약을 체결하기 이전에 각각 서비스 이용 계약에 따라 스피키안의 이용 약관에 동의하는 것으로 그 효력이 있습니다.(1) 확인기간  1. 고객은 업무를 진행함에 있어 발생하는 다양한 요청 등에 대해 공휴일을 포함하여 최대 7일 이내에 의사를 표시할 의무가 있습니다. 2. 7일 이내 의사를 표시 하지 않을 경우 처리되는 모든 사항(환불, 취소, 분쟁 해결 절차 등)에 대한 책임은 본인에게 있습니다.(2) 취소 1. 계약은 상호 확인을 통해 성립하게 되므로 계약 간 고객 또는 개발자는 계약에 대한 취소를 요청할 수 있습니다. 2. 계약 도중의 고객 또는 개발자의 취소 요청에 확인기간 동안 응답이 없을 경우 상대방의 요청에 동의한 것으로 간주됩니다. 3. 계약의 취소에 대해 상호 확인한 경우 회원 간 서비스 계약과 스피키안 에스크로에 따라 대금을 처리하게 됩니다.";

                    return MyDialog(
                      height: contentHeight,
                      child: const SingleChildScrollView(
                        child: Text(
                          content,
                        ),
                      ),
                    );
                  },
                );
              },
            ),
            const SizedBox(
              height: 24,
            ),
            SettingButton(
              title: "사업자 정보",
              onPressed: () async {
                showDialog(
                  context: context,
                  builder: (context1) {
                    const info = {
                      "대표자명": "이윤희",
                      "사업자등록번호": "829-04-02567",
                      "주소": "충청북도 청주시 흥덕구 강내면 황탄리길 226, 101동 1002호",
                      "이메일": "22speakean@gmail.com"
                    };

                    return MyDialog(
                      child: Column(
                        mainAxisSize: MainAxisSize.min,
                        crossAxisAlignment: CrossAxisAlignment.start,
                        children: [
                          for (final e in info.entries)
                            Padding(
                              padding: const EdgeInsets.symmetric(vertical: 6),
                              child: titleAndContent(
                                e.key,
                                e.value,
                              ),
                            ),
                        ],
                      ),
                    );
                  },
                );
              },
            ),
            const SizedBox(
              height: 24,
            ),
            SettingButton(
              title: "로그아웃",
              onPressed: () async {
                final userCubit = context.read<UserCubit>();
                PathManager.instance.pushNamedAndRemoveUntil(context, "login", (route) => false, isCanonical: false);
                userCubit.logout();
              },
            ),
            const SizedBox(
              height: 24,
            ),
            SettingButton(
              title: "탈퇴하기",
              titleColor: Colors.red.shade500,
              onPressed: () async {
                final userCubit = context.read<UserCubit>();
                PathManager.instance.pushNamedAndRemoveUntil(context, "login", (route) => false, isCanonical: false);
                userCubit.withdrawal();
              },
            ),
          ],
        ),
      ),
    );
  }

  Widget titleAndContent(String title, String content) {
    return Column(
      mainAxisSize: MainAxisSize.min,
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        Text(
          title,
          style: const TextStyle(
            fontSize: 12,
            fontWeight: FontWeight.w500,
            color: Colors.grey,
          ),
        ),
        const SizedBox(
          height: 4,
        ),
        Text(
          content,
          style: const TextStyle(
            fontSize: 14,
            fontWeight: FontWeight.w500,
            color: Colors.black,
          ),
        ),
      ],
    );
  }
}

class SettingButton extends StatelessWidget {
  final String title;
  final Color? titleColor;
  final Widget? tailing;
  final FutureVoidCallback? onPressed;

  const SettingButton({
    Key? key,
    required this.title,
    this.titleColor,
    this.tailing,
    this.onPressed,
  }) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return MyContainedButton(
      height: 48,
      borderRadius: 12,
      elevation: 5,
      onPressed: onPressed,
      child: Padding(
        padding: const EdgeInsets.symmetric(vertical: 12, horizontal: 20),
        child: Row(
          mainAxisAlignment: MainAxisAlignment.spaceBetween,
          crossAxisAlignment: CrossAxisAlignment.center,
          children: [
            Text(
              title,
              style: TextStyle(
                color: titleColor ?? Colors.black,
                fontSize: 18,
                fontWeight: FontWeight.w500,
              ),
            ),
            if (tailing != null) tailing!
          ],
        ),
      ),
    );
  }
}
